<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">


<!-- Mirrored from archive2.webstandards.org/about/mission/de/ by HTTrack Website Copier/3.x [XR&CO'2014], Tue, 22 Aug 2017 20:28:54 GMT -->
<head>
<meta name="MSSmartTagsPreventParsing" content="true" />
<title>WaSP : About : Mission</title>
<style type="text/css">
	@import "/inc/css/wsp.css";
</style>
<link rel="stylesheet" type="text/css" href="/inc/css/print.css" media="print" />

<script type="text/javascript" src="/inc/js/wsp.js"></script>
<!--
<script type="text/javascript" src="/inc/js/textResizer.js"></script>
<script type="text/javascript" src="/inc/js/linkChanger.js"></script>
-->

<style type="text/css">
<!--
vs0	{
	margin-top: 0;
	}

.small	{
	font-size: 11px;
	}

	
dl, dt, dd	{
	font-size: 11px;
	line-height: 1.5;
	}

	
#LangLinks {
	border: 1px solid #999;
	background-color: #eee;
	color: #000;
	padding: 3px 8px;
}

#LangLinks h4 {
	margin: 0;
	font-style: normal;
}

#LangLinks ul {
	margin-top: 0;
	margin-bottom: 0;
	font-size: smaller;
	color: #999;
}
-->
</style>
</head>
<body lang="iso-8859-1">
<div id="Header">
	<a href="/index.html" class="imgLink"><img id="logo" src="/img/logo.gif" height="100" width="103" alt="Web Standards Project logo" /></a>
<div id="headerText">
	<div id="intro">Das <a href="/index.html" id="logoLink">Web Standards Project</a>
	ist eine unabh&#228;ngige Bewegung, die f&#252;r
	<a href="/index.html">Standards</a> k&#228;mpft, um einen einfachen,
	m&#252;helosen Zugang zu Web-Technologien f&#252;r alle sicherzustellen.
	</div>
</div>

</div>

<div id="SiteNav">
	<ul>
	<li><a href="/index.html">home</a></li>
	<li class="active"><a href="/index.html">about</a>
		<ul>
		<li><a href="/bios/index.html">bios</a></li>
		<li><a href="/colophon/index.html">colophon</a></li>
		<li><a href="/contact/index.html">contact</a></li>
		<li><a href="/history/index.html">history</a></li>
		<li class="active"><a href="/index.html">mission</a>
			<!--
			<ul>
			<li><a href="/about/mission/nl/">Dutch (nl)</a></li>
			<li><a href="/about/mission/fr/">French (fr)</a></li>
			<li><a href="/about/mission/pt/">Portuguese (pt)</a></li>
			</ul>
			-->
		</li>
		<li><a href="/sitemap/index.html">sitemap</a></li>
		 <!-- <li><a href="/about/steering/">steering</a></li> --> 
		</ul>
	</li>
	<li><a href="/act/index.html">act!</a></li>
	<li><a href="/learn/index.html">learn</a></li>
	<li><a href="/opinion/index.html">opinion</a></li>
	<li><a href="/press/index.html">press</a></li>
	</ul>
	
	<div id="preferences"></div>
<div id="linkPreferences"></div>

</div>

<div id="MainText">
	<div class="padder"> 
  <h1>WaSP: F&#252;r Standards k&#228;mpfen</h1>

  	<p>Das World Wide Web Consortium (<a href="http://www.w3.org/" title="World Wide Web Consortium home">W3C</a>) hat &#8211; zusammen mit anderen Gruppierungen und Standards-Organisationen &#8211; Technologien entwickelt, um Web-basierte Inhalte herzustellen und zu interpretieren. Diese Technologien, die wir &#8220;Webstandards&#8221; nennen, wurden sorgf&#228;ltig entworfen, um f&#252;r die gr&#246;&#223;tm&#246;gliche Zahl von Internet-Nutzern den gr&#246;&#223;tm&#246;glichen Nutzen zu erzielen und gleichzeitig die Langlebigkeit von im Internet ver&#246;ffentlichten Dokumenten sicherzustellen (mehr zu Webstandards siehe Randspalte).</p>
  

	<p>Wer sich beim Entwerfen und Erstellen von Websites an diese Standards h&#228;lt, vereinfacht die Produktion und senkt die Kosten, w&#228;hrend gleichzeitig Websites entstehen, die f&#252;r mehr Menschen und mehr webf&#228;hige Endger&#228;te zug&#228;nglich sind. Websites, die gem&#228;&#223; dieser Richtlinien entwickelt wurden, bleiben auch dann voll funktionsf&#228;hig, wenn sich herk&#246;mmliche Desktop-Browser ver&#228;ndern und neue internetf&#228;hige Endger&#228;te auf den Markt kommen.</p>

	<p>Das h&#246;rt sich alles sehr einfach an und erscheint mehr als sinnvoll. Doch wo ist dann das Problem? Und wozu gibt es &#252;berhaupt ein <em>Web Standards Project</em>?</p>

	<h2>Das Problem</h2>

	<p>Obwohl die f&#252;hrenden Browserhersteller seit Gr&#252;ndung des W3C an der Entwicklung von Webstandards beteiligt waren, konnte man &#252;ber Jahre hinweg nur eine &#220;bereinstimmung beobachten: beim Bruch der Standards. Indem die Hersteller Browser auf den Markt brachten, die nicht in der Lage waren, die Standards konsistent zu unterst&#252;tzen, haben sie das Internet fragmentiert und Designern, Entwicklern, Nutzern und Unternehmen gleicherma&#223;en Schaden zugef&#252;gt.</p>

	<p>Der Mangel an einer einheitlichen Unterst&#252;tzung der W3C-Standards frustrierte die Konsumenten: Wenn sie den &#8220;falschen&#8221; Browser verwendeten, konnten sie im Web bestimmte Inhalte &#252;berhaupt nicht aufrufen oder die gew&#252;nschte Transaktion nicht durchf&#252;hren. Am h&#228;ufigsten wurden dadurch behinderte Menschen gesch&#228;digt oder solche mit besonderen Bed&#252;rfnissen.</p>

	<h3>Dilemma und Kosten</h3>

	<p>Gleichzeitig brachte der Mangel an einer einheitlichen Unterst&#252;tzung des W3C-Standards die Designer, Entwickler und Website-Betreiber in ein f&#252;rchterliches Dilemma: Konnten sie es sich leisten, von jeder einzelnen Webseite mehrere Versionen herzustellen, um nicht-kompatible Browser zu bedienen? Wenn nein, welche Browser sollten sie vernachl&#228;ssigen und wie viele Millionen potentieller Besucher waren sie bereit abzuweisen? Wie auch immer sie sich entschieden, der Preis war zu hoch. Er ist es immer noch.</p>

	<p>Der gesplittete Browsermarkt hat die Kosten f&#252;r die Entwicklung von Websites um mindestens 25 Prozent erh&#246;ht. Angesichts eines kleinen Budgets produzierten viele Entwickler Websites, die potentielle Kunden ausschlossen. Viele Entwickler kannten die Standards, doch sahen sie keinen Sinn darin, Websites f&#252;r Browser zu entwickeln, die die Standards nicht unterst&#252;tzen. Andere kannten die Standards so gut wie gar nicht &#8211; und viele kennen sie bis heute nicht, darunter Multi-Millionen-Dollar-Agenturen, die offensichtlich in der Lage sind, Technologien wie ASP, Java, Flash MX und .Net zu begreifen, aber von strukturellem Markup und Style Sheets keine Ahnung haben, geschweige denn davon, wie wichtig es ist, Struktur und Design zu trennen. </p>

	<p>Einige Designer &#8211; von der Inkompatibilit&#228;t der Browser in eine Sackgasse getrieben &#8211; verwendeten bewusst nur die &#228;ltesten und allgemeing&#252;ltigsten Web-Technologien auf ihren Websites. Solche Websites funktionierten meist zwar in allen Browsern, doch auf Kosten einer begrenzten Attraktivit&#228;t und Funktionalit&#228;t f&#252;r Kunden.</p>

	<p>Andere verlie&#223;en sich auf WYSIWYG-Editoren und Redaktionssysteme, mit denen sie etliche Versionen von Markup und Code generierten, um die Macken von verschiedenen beliebten Browser zu bedienen. Damit wurde sowohl Geld als auch Bandbreite verschwendet, und oftmals wurden Websites produziert, die in der n&#228;chsten Browser-Generation nicht mehr funktionierten (und die noch nie in alternativen Browsern oder alternativen Endger&#228;ten funktionierten &#8211; angefangen bei Screenreadern &#252;ber Lynx und PDAs bis hin zu weniger beliebten Browsern wie Opera). Das Internet ist zugem&#252;llt mit den &#220;berresten von einst beeindruckenden Websites, die in aktuellen Browsern oder anderen webf&#228;higen Endger&#228;ten nicht mehr funktionieren. Schlimmer noch: Solche Websites werden hier und heute weiter hergestellt.</p>

	<p>Einige Designer waren irgendwann so frustriert, dass sie den Webstandards den R&#252;cken kehrten. Sie fingen an, Websites ausschlie&#223;lich in propriet&#228;ren Umgebungen zu entwickeln. Obwohl solche Technologien ein hohes kreatives Potential haben, kranken sie an mangelnder Barrierefreiheit und sind nicht in der Lage, auf allgemeine Bed&#252;rfnisse zu antworten, wie etwa Bookmarken, Drucken, Kopieren, Einf&#252;gen und andere Aufgaben, denen Internet-Nutzer nachgehen m&#252;ssen, wenn sie sich online informieren oder Transaktionen vornehmen wollen.</p>

	<h3>Aus der Not geboren</h3>

	<p>Als Antwort auf diese Probleme wurde 1998 das <em>Web Standards Project</em> (WaSP) gegr&#252;ndet &#8211; mit dem Ziel, die grundlegenden Webstandards bekannt zu machen und die Browserhersteller zu ermutigen, es ihnen gleich zu tun. So sollte ein einfacher, m&#252;heloser Zugang zum Internet f&#252;r jeden Nutzer sichergestellt werden. </p>

	<p>Obwohl unsere Botschaft zun&#228;chst auf Widerstand stie&#223; (vor allem auf den der Marketing- und PR-Abteilungen der Browserfirmen), setzten wir uns schlie&#223;lich durch &#8211; zum Teil weil die Software-Ingenieure der Browserfirmen unsere Meinung teilten und das WaSP als einen Verb&#252;ndeten im internen Kampf mit der Gesch&#228;ftsleitung betrachteten.</p>

	<p>Ab 2000 begannen die f&#252;hrenden Browser schlie&#223;lich &#8211; einer nach dem anderen &#8211; sich an das Versprechen der Standards zu halten, das wir (manchmal lautstark) beworben hatten. Die derzeitigen Markf&#252;hrer unter den Browsern, zusammen mit einigen Konkurrenten, bieten heute eine hervorragende Unterst&#252;tzung von HTML 4, XHTML 1, CSS, ECMAScript (der Standard-Version von JavaScript) und des DOM &#8211; oder sind auf dem Weg dorthin. </p>

	<p>Dank solcher Browser sind Designer und Entwickler nun endlich in der Lage, XHTML und CSS zu verwenden &#8211; und in vielen F&#228;llen sogar Struktur und Design zu trennen, um die Portabilit&#228;t und den Zugang f&#252;r Behinderte zu verbessern. Mit Vorsicht k&#246;nnen die Designer und Entwickler sogar das standardisierte DOM verwenden, um ihre Websites mit ausgefeilten interaktiven Komponenten auszustatten.</p>

	<p>Wo ist dann das Problem? Und wozu gibt es das <em>Web Standards Project</em> immer noch?</p>

	<h2>Herausforderungen, die vor uns liegen</h2>

	<p>Obwohl die aktuellen Browser viele der Standards bereits unterst&#252;tzen, gibt es immer noch zehntausende professioneller Webdesigner und Entwickler, die weiterhin veraltete Methoden verwenden, welche die Struktur an das Design ketten, in manchen F&#228;llen gar die semantische Struktur ganz missachten, und (X)HTML als Design-Werkzeug missbrauchen. Hochbezahlte Fachleute produzieren weiterhin massenhaft nicht-valide, unzug&#228;ngliche Websites voll von strukturell bedeutungslosem Markup, riesigen Image Maps, ma&#223;los verschachtelten Tabellen und &#252;berholten Browser-Detection-Scripts, die genau die Usability-Probleme verursachen, die sie urspr&#252;nglich verhindern sollten. </p>

	<p>Viele Webdesign-B&#252;cher bringen den Lesern immer noch die veralteten Methoden bei und viele Profis sind stolz darauf, Websites abzuliefern, die in jedem Browser &#8211; ob er Webstandards unterst&#252;tzt oder nicht &#8211; gleich aussehen und gleich funktionieren &#8211; auf Kosten des barrierefreien Zugangs, der Langlebigkeit und Aufw&#228;rts-Kompatiblit&#228;t. Andere entwickeln propriet&#228;ren Code, der nur einigen wenigen popul&#228;ren Browsertypen funktioniert.</p>

	<p>Daher ist es eines der grundlegenden Ziele des WaSP, Lehrmaterialien bereit zu stellen, die unseren Gleichgesinnten dabei helfen, die Methoden zu erlernen, die den Standards entsprechen &#8211; in ihrem eigenen Interesse und dem ihrer Kunden und Nutzer.</p>

	<p>Viele Profis verwenden bei ihrer Arbeit WYSIWYG-Editoren, die auf dem H&#246;hepunkt der Browser-Kriege entwickelt wurden. Wie bereits erw&#228;hnt, erzeugen solche Werkzeuge nicht-valide, unsemantische Websites, die optimiert sind f&#252;r die Macken der 4.0-Browser und sich nicht an den Webstandards orientieren. Zwei f&#252;hrende WYSIWYG-Editoren haben 2002 ihre Unterst&#252;tzung f&#252;r Webstandards und Accessibility massiv verbessert (einer davon mit Hilfe des <em>Web Standards Project</em>). Um aus solchen Verbesserungen tats&#228;chlich einen Nutzen zu ziehen, m&#252;ssen die Webentwickler zun&#228;chst die Grundlagen erlernen und erkennen, welchen Vorteil das Entwerfen und Erstellen von Websites mittels Webstandards mit sich bringt. Das wiederum zeigt, wie wichtig Weiterbildung f&#252;r Webentwickler ist.</p>

	<p>F&#252;r Kunden und Website-Betreiber sind diese Erkenntnisse ebenfalls
wichtig, wenn ihnen an Websites gelegen ist, die in den Browsern und
Endger&#228;ten von heute genauso zug&#228;nglich sind wie in den Browsern und
Endger&#228;ten von morgen. Das WaSP hofft, dass die Website-Betreiber &#8211;
wenn sie erst &#252;ber den Nutzen von Webstandards aufgekl&#228;rt wurden
&#8211; ihr Internet-Angebot nicht l&#228;nger als eine Art
Print-Brosch&#252;re betrachten, die in jeder Umgebung exakt gleich auszusehen
hat. Und dass sie stattdessen Wert darauf legen, Inhalt und Funktionalit&#228;t
mediengerecht anzubieten &#8211; abh&#228;ngig vom Kontext der
Pr&#228;sentation, der je nach Bed&#252;rfnis und F&#228;higkeit der
verschiedenen Browser und Endger&#228;te leicht variieren kann. </p>


	<h4>Urspr&#252;ngliches Mission Statement</h4>

	<p>Das urspr&#252;ngliche <a
href="http://archive.webstandards.org/mission.html">Mission Statement
(1998)</a> des WaSP ist &#252;ber das archive.webstandards.org abrufbar.</p>

	<p>&copy; 1998-2002 Web Standards Project, www.webstandards.org</p>
	
	<p>(deutsche &#220;bersetzung: <a href="&#109;&#97;&#105;&#108;&#116;&#111;&#58;&#104;&#101;&#105;&#107;&#101;&#46;&#101;&#100;&#105;&#110;&#103;&#101;&#114;&#64;&#106;&#97;&#118;&#97;&#106;&#105;&#109;&#46;&#100;&#101;">Heike Edinger</a>, <a href="http://www.javajim.de/">www.javajim.de</a>)</p>

	</div>
	
	<div class="padder" id="footer">
		<a href="/legal/index.html">Legal</a>

	</div>
</div>

<div id="SubNav">
  <div class="padder">
<!-- include directly here -->
	<div id="LangLinks">
		<ul>
		<li>Deutsch (de)</li>
		<li><a href="/index.html">Englisch (en)</a></li>
		<li><a href="/fr/index.html">Franz&ouml;sisch (fr)</a></li>
		<li><a href="/it/index.html">Italienisch (it)</a></li>
		<li><a href="/jp/index.html">Japanisch (ja)</a></li>
		<li><a href="/nl/index.html">Niederl&auml;ndisch (nl)</a></li>
		<li><a href="/pt/index.html">Portugiesisch (pt)</a></li>
		</ul>
	</div>
  <div class="padder">
</div>
		<h4 class="vs0">Welche &#8220;Standards?&#8221;</h4>

	<p class="small">Wenn wir von &#8220;Standards&#8221; f&#252;rs Web sprechen, dann meinen wir:</p>

<dl>
	<dt>Struktuelle Sprachen</dt>
		<dd><a href="http://www.w3.org/TR/xhtml1" title="XHTML 1.0 Specification">Extensible Hypertext Markup Language (<span class="abbr">XHTML</span>) 1.0</a></dd>
		<dd><a href="http://www.w3.org/TR/xhtml11" title="XHTML 1.1 Specification"><span class="abbr">XHTML</span> 1.1</a></dd>
		<dd><a href="http://www.w3.org/TR/2000/REC-xml-20001006" title="XML 1.0 Specification">Extensible Markup Language (<span class="abbr">XML</span>) 1.0</a></dd>
	<dt>Darstellende Sprachen</dt>
		<dd><a href="http://www.w3.org/TR/REC-CSS1" title="CSS Level 1 Specification">Cascading Style Sheets (<span class="abbr">CSS</span>) Level 1</a></dd>
		<dd><a href="http://www.w3.org/TR/REC-CSS2" title="CSS Level 2 Specification"><span class="abbr">CSS</span> Level 2</a></dd>
		<dd><a href="http://www.w3.org/Style/CSS/current-work" title="Level 3 Current Work"><span class="abbr">CSS</span> Level 3</a></dd>
	<dt>Objektmodelle</dt>
		<dd><a href="http://www.w3.org/TR/1998/REC-DOM-Level-1-19981001/" title="DOM Core Specification">Document Object Model (<span class="abbr">DOM</span>) Level 1 (Core)</a></dd>
		<dd><a href="http://www.w3.org/DOM/DOMTR#dom2" title="DOM Level 2 Specification Links"><span class="abbr">DOM</span> Level 2</a></dd>
	<dt>Skriptsprachen</dt>
		<dd><a href="http://www.ecma.ch/ecma1/STAND/ECMA-262.HTM" title="ECMA 262 Standard">ECMAScript 262</a> (the standard version of JavaScript)</dd>
	<dt>Zus&#228;tzliche darstellende Sprachen (Markup)</dt>
		<dd><a href="http://www.w3.org/1999/07/REC-MathML-19990707/" title="MathML 1.01 Specification">Mathematical Markup Language (MathML) 1.01</a></dd>
		<dd><a href="http://www.w3.org/TR/MathML2" title="MathML 2.0 Specification">MathML 2.0</a></dd>
		<dd><a href="http://www.w3.org/TR/SVG/" title="SVG 1.0 Specification">Scalable Vector Graphics (<span class="abbr">SVG</span>) 1.0</a></dd>
</dl>

	<p class="small">... sowie neu entstehende Standards, wie die f&#252;r TV&#8211; und PDA-basierte Browser.</p>

	</div>
</div>
</body>

<!-- Mirrored from archive2.webstandards.org/about/mission/de/ by HTTrack Website Copier/3.x [XR&CO'2014], Tue, 22 Aug 2017 20:28:54 GMT -->
</html>
<!-- $Id: index.html,v 1.12 2003/09/02 13:38:31 mgutfeldt Exp $ -->